In [2]:
import pandas as pd
import yfinance as yf
from datetime import datetime

Setting start and end dates to fetch the data from

In [127]:
number_years = 10

timestamp_end = datetime.now()
timestamp_start = datetime(timestamp_end.year - number_years, 
                           timestamp_end.month, 
                           timestamp_end.day)

Making a dictionary of the companies I'm interested in

In [128]:
companies = {'Amazon': 'AMZN',
             'Nvidia': 'NVDA',
             'META'  : 'META',
             'AMD'   : 'AMD',
             'GitLab': 'GTLB'}

Fetching the data for the companies listed above

In [129]:
dataset = {}

for company_name, ticker in companies.items():
    dataset[company_name] = yf.download(ticker, timestamp_start, timestamp_end)

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [130]:
dataset['Nvidia'].head()

               Open     High      Low    Close  Adj Close     Volume
Date
2014-07-30  0.44725  0.45325  0.44600  0.45200   0.430276  246184000
2014-07-31  0.44650  0.45000  0.43675  0.43750   0.416473  401880000
2014-08-01  0.43750  0.44475  0.43600  0.44225   0.420994  219884000
2014-08-04  0.44175  0.44550  0.43900  0.44125   0.420043  241724000
2014-08-05  0.44000  0.44800  0.43625  0.44150   0.420280  298136000

Merging the data fetched into a dataframe

In [131]:
dataframes = []

for company_name, company_data in dataset.items():
    # restting the index to turn the DatetimeIndex into a column
    temp_dataframe = company_data.reset_index()
    
    temp_dataframe['company_name'] = company_name
    temp_dataframe['ticker'] = companies[company_name]
    
    # reordering the columns
    temp_dataframe = temp_dataframe[['company_name', 'ticker', 'Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
    
    dataframes.append(temp_dataframe)

# concat all DataFrames in the list
dataframe = pd.concat(dataframes, ignore_index=True)

In [132]:
dataframe.head()

,company_name,ticker,Date,Open,High,Low,Close,Adj Close,Volume
0,Amazon,AMZN,2014-07-30,16.0725,16.136499,15.9250,16.1255,16.1255,79380000
1,Amazon,AMZN,2014-07-31,16.0005,16.034000,15.5930,15.6495,15.6495,103840000
2,Amazon,AMZN,2014-08-01,15.6845,15.791500,15.2295,15.3530,15.3530,148830000
3,Amazon,AMZN,2014-08-04,15.4420,15.809000,15.4250,15.6825,15.6825,84018000
4,Amazon,AMZN,2014-08-05,15.6650,15.727500,15.5030,15.6160,15.6160,57042000

Saving the dataframe

In [133]:
dataframe.to_csv(f'yFinance {timestamp_start.date()} to {timestamp_end.date()}.csv', index=False)